package forum.dao;

public class DaoId {
    public final static String URL = "jdbc:mysql://localhost:3306/elitebaby";
    public final static String USER = "root";
    public final static String PASSWORD = "password";

    static String content = "當孩子年齡越來越大，勢必會越來越有自己的想法，如果仍慣性地使用過去對待「小小孩」的方式跟他們互動，他們只會從父母那兒感受到被監控、被批判的束縛與壓力，進而想要逃離，去呼吸自由的空氣。\n" +
            "即便這些監控、批判的出發點是基於關心與善意，但在得不到尊重與認可的情況下，孩子選擇轉身離去，投入同溫層的懷抱，就成了必然的結果。\n" +
            "面對越來越有個性和想法的「酷」小孩，為人父母該如何是好呢？\n" +
            "我認為，從「感興趣」的角度、用「感興趣」的態度去與他們互動、相處，會是一條「雙贏」的活路。\n" +
            "做孩子的「參謀」，是需要學習的\n" +
            "聖誕假期，小學六年級的女兒和班上同學私下相約，要看電影，順便逛街。\n" +
            "由於她是「先斬後奏」，事先並未與我或太太討論，因此當我們得知消息時，第一時間的反應都是不置可否，對幾個小六生要出門一整天，覺得有些擔心，不太同意這件事。\n" +
            "但回想起自己從前跟同學一塊出門晃遊的經歷，確實充滿許多愉快、美好的回憶，也就不忍直接否定她的計畫。\n" +
            "直到她要出門的前一天，我們才針對這件事情「直球對決」。\n" +
            "女兒興高采烈地說著，她多麼期待有生以來第一次「沒有大人」隨行的逛街行程。\n" +
            "可她說得越興奮，就越增添我的擔心，便打趣地對她說：「聽起來很好玩的樣子。乾脆我載你們去百貨公司，順便去那裡的書店逛逛，喝杯咖啡，在那邊等你們一起回家。你覺得如何？」\n" +
            "女兒皺著眉頭，十分抗拒地說：「不要！不要！就跟你說不要有大人跟了嘛！你這樣，我們會很不自由。」\n" +
            "看來她只想要我擔任司機就好，「不給跟」的意圖相當堅定。";
}
